app/Modules/Contact/Repositories/ContactRepository.php

select `id`, `name`, `email`, `phone`, `sources`, `tags`, `notes`, `created_at`, `updated_at` from `contacts` where `user_id` = 1 and `contacts`.`deleted_at` is null order by `name` asc limit 15 offset 0
select count(*) as aggregate from `contacts` where `user_id` = 1 and `contacts`.`deleted_at` is null
---
    public function paginateWithFilters(User $user, ?string $search = null, array $sourceFilters = [], string $sortBy = 'created_at', string $sortDirection = 'desc', int $perPage = 15): LengthAwarePaginator
    {
        $query = Contact::select(['id', 'name', 'email', 'phone', 'sources', 'tags', 'notes', 'created_at', 'updated_at'])
            ->where('user_id', $user->id)
            ->when($search, fn ($q) => $q->search($search))
            ->when(!empty($sourceFilters), function ($q) use ($sourceFilters) {
                $q->where(function ($subQuery) use ($sourceFilters) {
                    foreach ($sourceFilters as $source) {
                        $subQuery->orWhereJsonContains('sources', $source);
                    }
                });
            })
            ->orderBy($sortBy, $sortDirection);

        return $query->paginate($perPage);

select
COUNT(*) as total,
SUM(JSON_CONTAINS(sources, '["crm"]')) as crm,
SUM(JSON_CONTAINS(sources, '["telegram"]')) as telegram,
SUM(JSON_CONTAINS(sources, '["whatsapp"]')) as whatsapp,
SUM(JSON_CONTAINS(sources, '["google_oauth"]')) as gmail
from `contacts` where `user_id` = 1 and `contacts`.`deleted_at` is null limit 1
---
    public function getContactStatsByUser(User $user): array
    {
        // Single query with JSON extraction for better performance
        $stats = Contact::selectRaw('
            COUNT(*) as total,
            SUM(JSON_CONTAINS(sources, \'["crm"]\')) as crm,
            SUM(JSON_CONTAINS(sources, \'["telegram"]\')) as telegram,
            SUM(JSON_CONTAINS(sources, \'["whatsapp"]\')) as whatsapp,
            SUM(JSON_CONTAINS(sources, \'["google_oauth"]\')) as gmail
        ')
        ->where('user_id', $user->id)
        ->first();